#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/lsy/gitops-demo-3/runs/run-FgkUveMhfRQLvtu4

Waiting for the plan to start...

Terraform v0.13.6
Configuring remote state backend...
Initializing Terraform configuration...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

azurerm_resource_group.example: Refreshing state... [id=/subscriptions/1336ece0-3256-4a2e-b051-e83ca0c7cd51/resourceGroups/aks-resource-group]
module.network.data.azurerm_resource_group.network: Refreshing state... [id=/subscriptions/1336ece0-3256-4a2e-b051-e83ca0c7cd51/resourceGroups/aks-resource-group]
module.network.azurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/1336ece0-3256-4a2e-b051-e83ca0c7cd51/resourceGroups/aks-resource-group/providers/Microsoft.Network/virtualNetworks/acctvnet]
module.network.azurerm_subnet.subnet[0]: Refreshing state... [id=/subscriptions/1336ece0-3256-4a2e-b051-e83ca0c7cd51/resourceGroups/aks-resource-group/providers/Microsoft.Network/virtualNetworks/acctvnet/subnets/subnet1]
module.aks.data.azurerm_resource_group.main: Refreshing state... [id=/subscriptions/1336ece0-3256-4a2e-b051-e83ca0c7cd51/resourceGroups/aks-resource-group]
module.aks.module.ssh-key.tls_private_key.ssh: Refreshing state... [id=30fd899412aaddfb3e4414ec97a0cbcca95c94b1]
module.aks.module.ssh-key.local_file.private_key[0]: Refreshing state... [id=38fa47fc44a985f2bc2ce309ff1bfe007872f225]
module.aks.azurerm_log_analytics_workspace.main[0]: Refreshing state... [id=/subscriptions/1336ece0-3256-4a2e-b051-e83ca0c7cd51/resourceGroups/aks-resource-group/providers/Microsoft.OperationalInsights/workspaces/prefix-workspace]
module.aks.azurerm_log_analytics_solution.main[0]: Refreshing state... [id=/subscriptions/1336ece0-3256-4a2e-b051-e83ca0c7cd51/resourcegroups/aks-resource-group/providers/Microsoft.OperationsManagement/solutions/ContainerInsights(prefix-workspace)]
module.aks.azurerm_kubernetes_cluster.main: Refreshing state... [id=/subscriptions/1336ece0-3256-4a2e-b051-e83ca0c7cd51/resourcegroups/aks-resource-group/providers/Microsoft.ContainerService/managedClusters/prefix-aks]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.aks.data.azurerm_resource_group.main will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_resource_group" "main"  {
      ~ id       = "/subscriptions/1336ece0-3256-4a2e-b051-e83ca0c7cd51/resourceGroups/aks-resource-group" -> (known after apply)
      ~ location = "eastus" -> (known after apply)
        name     = "aks-resource-group"
      ~ tags     = {} -> (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.aks.azurerm_kubernetes_cluster.main must be replaced
-/+ resource "azurerm_kubernetes_cluster" "main" {
      - api_server_authorized_ip_ranges = [] -> null
        dns_prefix                      = "prefix"
      - enable_pod_security_policy      = false -> null
      + fqdn                            = (known after apply)
      ~ id                              = "/subscriptions/1336ece0-3256-4a2e-b051-e83ca0c7cd51/resourcegroups/aks-resource-group/providers/Microsoft.ContainerService/managedClusters/prefix-aks" -> (known after apply)
      ~ kube_admin_config               = [
          - {
              - client_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUZIVENDQXdXZ0F3SUJBZ0lRSzNzV1hMamI0SHRvYXZPaEtLSWh1VEFOQmdrcWhraUc5dzBCQVFzRkFEQU4KTVFzd0NRWURWUVFERXdKallUQWVGdzB5TVRBek16QXhNVEk0TWpGYUZ3MHlNekF6TXpBeE1UTTRNakZhTURBeApGekFWQmdOVkJBb1REbk41YzNSbGJUcHRZWE4wWlhKek1SVXdFd1lEVlFRREV3eHRZWE4wWlhKamJHbGxiblF3CmdnSWlNQTBHQ1NxR1NJYjNEUUVCQVFVQUE0SUNEd0F3Z2dJS0FvSUNBUUN2SGFhZ0phYXJFN2k1ZkpjbldOaUIKclN5V3EzVzJVR0g1NjhuZmpIMXRUSW51NEEzUFN5WEJ3ZkV2TElUNENDU1dCdkEzZGxVVWU0WE1UZUorQ2EzeApWanJScXpyVEpsU3pjcTNweG1GazU2QnpMTUkrK3pPcGpVaFNYYkdkbzhzUCtFZHRLQTJ2Y2hXOWZvcTlUSEtMCjZRcGQybmoxWHlMRnRPOEM3bWJOcTIvdFd1WlV5SHphSmpCbFNGdkNHZFNPMnFxN09CR2ZTZVE5dDBKaTZEZGUKaC9RQWd0YkJIb3REdjJFVTRUU1pBenh2MG5iUE85ZUwySVVEdWY3eW9FdHhPa2UyOVpkcHQ3ekppbHhLSHJWUwpZUzJkSTZmUmYwczI4cFRLa1R3aUNCMDBUOVkrVDVNTDlDeENLUHdrZEJvYmx1SnVBdktzSlY5dk1BWUhLdlRYCm9vQTgxY1hMM1FhazNBYndhQnFHRi9mT2RoN2oxK2UwbWJxeDhSNDZ6RnZtOU5YUnRxU1NDOVl1RlZpTUNqVWwKNWFIcVhHaXBycmtnbFRmRlJkb3hYbHpuZGhFeEJieHBpVTVxY2sxcTNxWHpHNnlzdDREZFlrOFFJVDltK2RmTQpGN0Zxcm5MbmlTWG82M1lGRXp6UzJYQnhTSXg0b3Y2ZWVhTm1xREpod3ArZEhCWStIb2JZY2FkdHlzeTNnL3V6CmdOSDREOEtrQUlvZWQ0NFA4N05FTXJNV1F3ekhGZW55VUFWV0U3a2x6QWJwYXI0TFkyV2U1TnQ3VjVkMmh1THAKN0FHNWcxQm05NzF3SUx1dGhmM3VveUJFQ3Z2RTVqNGJBTXVWTzd6TXBiMnA2OVBIVTR6cGZMUzZIYktHZ3JWZAo3c0YxbWtrTGZ3aXNsemdOM3V4Uy93SURBUUFCbzFZd1ZEQU9CZ05WSFE4QkFmOEVCQU1DQmFBd0V3WURWUjBsCkJBd3dDZ1lJS3dZQkJRVUhBd0l3REFZRFZSMFRBUUgvQkFJd0FEQWZCZ05WSFNNRUdEQVdnQlMzVVNrYXQrT04KbnVzR0VvTDUxOUlackc3YWREQU5CZ2txaGtpRzl3MEJBUXNGQUFPQ0FnRUE0MGl3bTl5MHNXM2tNVER6dWpsNwpWdFVZeXIydFRNbnVpbFI3RHNxUzNlSWROanJPR1RFaU9XR3Q0Wi9vNlAvakhGNURLb0tZQXpZUTd4ZHNlL1FPCi9lVEZTZXpkblVYYkJTSUNaY05KNThNZFRnYjNZVC9pRjIyS1NnTERTalNDUVgrVmNTeGRYanhJQTN5OG9MSFUKNHBXMEVyZ2FHaFNNUDRQRXAxcVlJT2cwZ0FldCtoa1hrcWozQXdTRzNtYnFlZVZNei82ODdQK3h6SlZhR2UwbApWbHAzaDlqMW54SlNSSE01MU5tTkFob2xVa0t1WjZEa1ZNS3BuL0RXL0p3NzNQbmpXZWNqcm1jVUVzM2tKdVVOCmtmSE9VaUl2QXN3U2FMN1NxSit0d1dRYUpvLzAyODMwZDBtdDhyMzNJaWpDQmt6UE5vNXpJbFhML3JwcnVveU4KcVJSN0lzRTRGYnFDUk03ZS9FUGdUbzlQdDJwdXNuT01IZE9OWStudjAxVjFxaXlxeE1BT25Wd3VQYkYrL3VGNwpkNzMvYkZFQmlzTWtqTTFSaGF0c0xYRnA4KzViZFIxZ3dSaTVmNDdYSFdpdXdkZlJHNkhCM3FkN09oSUljKzRvCjZyME9HODNZbWs1QlZPTXRpNERNVmluc3pENHk2TW1IazIxWk9panF1ck5FUlVQMjZCeHFKUWFJNER4R21xcjMKZkdJMXZBT1hHdzRNR3RlY09iQnBQVDYveXM3Y2ZUT1VTSHZtRUpxUEV4OTFFSzFvTnh0VGNmVWtoMEcxakY5TgpmYWxvYTFNSlhpVlhtNFFwWDZpd1JDL0FxR0NoMDZMWkk1R0RaV3hoSWprSGFVT041MFIwWEwrb0pqVTZpNDBECnIrVGNaR2t6a0k0bks5Mm9CdUllQVhRPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
              - client_key             = "LS0tLS1CRUdJTiBSU0EgUFJJVkFURSBLRVktLS0tLQpNSUlKS1FJQkFBS0NBZ0VBcngybW9DV21xeE80dVh5WEoxallnYTBzbHF0MXRsQmgrZXZKMzR4OWJVeUo3dUFOCnowc2x3Y0h4THl5RStBZ2tsZ2J3TjNaVkZIdUZ6RTNpZmdtdDhWWTYwYXM2MHlaVXMzS3Q2Y1poWk9lZ2N5ekMKUHZzenFZMUlVbDJ4bmFQTEQvaEhiU2dOcjNJVnZYNkt2VXh5aStrS1hkcDQ5VjhpeGJUdkF1NW16YXR2N1ZybQpWTWg4MmlZd1pVaGJ3aG5VanRxcXV6Z1JuMG5rUGJkQ1l1ZzNYb2YwQUlMV3dSNkxRNzloRk9FMG1RTThiOUoyCnp6dlhpOWlGQTduKzhxQkxjVHBIdHZXWGFiZTh5WXBjU2g2MVVtRXRuU09uMFg5TE52S1V5cEU4SWdnZE5FL1cKUGsrVEMvUXNRaWo4SkhRYUc1YmliZ0x5ckNWZmJ6QUdCeXIwMTZLQVBOWEZ5OTBHcE53RzhHZ2FoaGYzem5ZZQo0OWZudEptNnNmRWVPc3hiNXZUVjBiYWtrZ3ZXTGhWWWpBbzFKZVdoNmx4b3FhNjVJSlUzeFVYYU1WNWM1M1lSCk1RVzhhWWxPYW5KTmF0Nmw4eHVzckxlQTNXSlBFQ0UvWnZuWHpCZXhhcTV5NTRrbDZPdDJCUk04MHRsd2NVaU0KZUtMK25ubWpacWd5WWNLZm5Sd1dQaDZHMkhHbmJjck10NFA3czREUitBL0NwQUNLSG5lT0QvT3pSREt6RmtNTQp4eFhwOGxBRlZoTzVKY3dHNldxK0MyTmxudVRiZTFlWGRvYmk2ZXdCdVlOUVp2ZTljQ0M3cllYOTdxTWdSQXI3CnhPWStHd0RMbFR1OHpLVzlxZXZUeDFPTTZYeTB1aDJ5aG9LMVhlN0JkWnBKQzM4SXJKYzREZDdzVXY4Q0F3RUEKQVFLQ0FnRUFpVlN6aS94N0RNZFdvd0MyZWNFUGFnTXBhSy9taktmVmJtNGZ6eFVhZUZFQ0N6ZmpIS0pPWmZsMgo4QXYxNjU1WE11RVdHaWpPNkZWR3hNWi96V0JCN1hZMmdwL0tialV0VDkycnpoNHAyenhiZEhleGpqcnFkUm03CmtmeXdnblFsbDh5YUYxekYvc1YxanpwaUM3cWNTbVRrSUY1cFplVEtIRXFjOXF1SUs5czYxK1hscEsvbVdoNkEKN2EwbGFMOWhGdmNkMWQxTzFLRGFRaHdxRCs4VkhTbDVqYjBPTmoyQjhndHdVek9hVURWZGZFU05zRSs1NW81VApJbTBISjdmVjhtSkdRNUd1d05XN1ZFTVJ4WDczckRkUjBsNVlDYy9PYUxVdFF2OUxMVlUzc2dLNmZmdGgwb29XCiszdXc0ZFc3YzgrTW04SHNGbHpvendYV2RHQ1h5Z2dwdit4aXQ3elBiNldWQnN0a0M5aVh3VGIwcnpLUTJCamwKN2wrWGdjbnpNRzhsUWNpcjlnaTdaQmZmdFI0bDNTR0NDSS9WTms3eVNIaFRTMGJnQzRwbVNYWHRnNnQ2NnNtVwo0dnI0b2VUK29sTDN1NnpXdHdLS2puc3dLQ044L0FJSFNuZWNKZEZSS3c1VXkzQVlzWVo0ZTFiR05jOXpTYjVFCkd0Z1Z6SWpsKzR4RDFWTnVwbnUzUTU0c0luVUV2Y3pzMDRHcDdHT3ViU2NoZW9WcmhuMjJJWTJHYnhKN0cwWDcKV1VjK3VQa2xrVHlMWU9wdTV4L0p3ZU9uZmtXcTdsUUJGL2w4WGx2SmdXYU5JYWdENklwNmJTQ0JzN0VweXB4UAovWlNEU3BLL3E1Q1V2UE02YXJ3RU5NTzNLbXJldjhNMjJrNkRnbDZxdXUzbjloSGRHc0VDZ2dFQkFOTDM0ODIzCjRQdDVMMFUxek5MWEtXdW9TMWtEUDRlQUozM3Bmbzl3a0htZXFCSTd2K3NDUWpVUzVWODB0V0FxL21wb2FKdlEKaEpWY2RvcDc5dHVRdnBEdnllRW01RkdjU3l1NXhMUWpNQUhBbnNkMFozZGtpK09xM3dCUTFFSGdqUXBaSXRISAo5ZjRNYk1NRHJIeUxSalBGZGZ2SnF4aDNhWTNLYWtzNnliR2dTbGd5dVJ0QnloWmFWMXM3S1JISmRodVlYamVvCmU5T05CWGlsbEhWRlM4ZjlKQVBLUWlaUUFhZ21JNU0vbkhwVFVQVVVrdjVRRDArRHA2ZHNGdjd1S0dDYzlUV28KL0gxaXJjRGxIQ0VvazhRQi8zeVRpeVRHdHJoOGFWZm5TaVVYM3lnNXRLalZ6Y1R0Tm9nRDd1ZlhLOWExZGJpZwpOcGZGOXJQZW10czJ5a2tDZ2dFQkFOUitwUDF4R09NbWpRM2d0NnlQUzQ0d0duWDFWblMwa0NYMzJ6czhjNnBICmZBb1ZEZGRIM1ZWellzRmwzRitDazZ1YWhtelRmSzdZeGFTcVlBSEtVckZ4dC9nNFgyMU51NCt1Tk96b2IvM0oKaWdrT3FCYldNQVE5K21PMEFDNXRQTFMvWFJZVExXZ29pNlFuWWxqS05QZUxYNk96VEtCVzAzSlg3eXcxNlkrWgpvVjkvQkRDSlhYRXJMa2NCVGpUTG1VRmptUmcxcVZBNFB6M1ZodFlCRER3YkpIOFlkUkowL2lPQlpta0JMUktyCmplM3JKc3hVYzh2Wm1ncXlLdU1GZmZMWEswR2VTcWl5b3czUnlRUGxqTmtxaXZPK3U4T0MyVmdFSVJhOEhKQUUKZjNpV1pqb21PNm5XaUZqTG9XQ2E2NGpESnBzOWNEZkpiVU5Pd0JjZWN3Y0NnZ0VCQUtrQitiZFdOYUNBQnNSMQpReTh0TzN1SmlVTTMvTzc2VmFqakk0YVo4TVBkdkZ0UERvS2dmcFd5RzVyWHlPM1B3NTFQSTI2ZjczY1FhYzZyClhLbXRIVjFURy9HSmpLTnNpRFB4VUluWEhxQm94VXFZRUVOdmd6blNLM0EvVUt1dHpvK1p0UEZHTmVWZDRzdWYKNTlDbWFva1RDVis2d1p5S0hUK0FCd05aaHpjTGFFT2I3dnJOQzY0NGxYNzZ0LzROM05aaWpDZ2VpNFNBbHY5OQo5cDZ6OHUrMTllSXJhQzcxTFQ2ZHZ5WTVjWXYxcndlSGdmTEdCRjM0NUppVldSN0ZnQWRWOW9NVWE2R3ZLZTg4CkcvcmNYUFJMZlhjNVkrRUVhR0VIR2dWWHZ1aFVaV3YrUHFKN0ZhdExOY0psRkVFYStYMjZSU0t4QnNzenhsMTIKV2F5QUNqRUNnZ0VBUXZicUxjaHZiRjRndzRmV3VqV3FQTlBoOHR4dTgzWlhtdStDRWlmWjE0YVJpMmZaSmNmSwo4M3ZhV2xJc1laajN5bk4yKzJLbWZ6OW5BWjZEaE96cXBHck83QlZ2MVRWUzcxT1o4RExMNERHY0k0Q1A3aXB2CmxWYW15cmJWKzh1Ry92cnpiZHA3UzhERFNPYjBja0MrOG1ma3F1VDlOK1pFMmxybHo0dnAzOHd0YzdmR2JUbE0KempZcWJrdjJCbU5IRjdrNGJNMjBYc2hxL2FTRnlua29EdVVLMmxhdHhqUkNScFFuM3QxMUE5WTJjd3pRL0VGOQpBSGZCdUs4dkhyNERVLzBFNzdmZmxVdytZRU9GVW9vTG1nQnpLNThtOHRVUWcxRkIwRFZWMXZqajV1K1dwYXFZCjBNdi95ZVBhSm1TTDUxeUFsUm1HZkw0b2hiYVNpSGFiRHdLQ0FRQU0vNnRjeXJIV3NDL0s3azNKYXU1OVFsYmkKc2JObEUrUWJnUGdubmtUM2lXTGlScWMvclBUMEZ6RXlYWnZGSUhaY3VDbkJqa3AvOC9zRDh2VzdkOGd3d1hILwp6V2IyZWFQZVgvN3o2QTUvdUpjWFZMT2Jjbnk2Y2dKVHFrRmJBeXBUcG5iWGxXM05IM0hFT2wxTWVralBYSmJLCllJNVExTldYbXNlT2tsT0JxVUVBTm9kcWRkZUtqemRaUS9RRjNPd2RyUWxhSXdjallaSE5tTU40cEFXVnFpd3QKbkRsZmtydmh4THZlamo3Z2NicENvRFlTa2I3aVc2MVhqc2tUdi85WWszVUhKMW1tSDJwcGd2RVFQeFNBMFhqMQoxOFRra0FzbkdOSVFzNXh5YzFVaXp5dElQVjlhcHlVckdETDNsZFNSRTJvU04wU0pETE4vak1ma3Z2ei8KLS0tLS1FTkQgUlNBIFBSSVZBVEUgS0VZLS0tLS0K"
              - cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUU2VENDQXRHZ0F3SUJBZ0lSQUl6UUxOMHMxNm9HYnN3N3Y3amlmMnN3RFFZSktvWklodmNOQVFFTEJRQXcKRFRFTE1Ba0dBMVVFQXhNQ1kyRXdJQmNOTWpFd016TXdNVEV5T0RJeFdoZ1BNakExTVRBek16QXhNVE00TWpGYQpNQTB4Q3pBSkJnTlZCQU1UQW1OaE1JSUNJakFOQmdrcWhraUc5dzBCQVFFRkFBT0NBZzhBTUlJQ0NnS0NBZ0VBCjVJMXo4ZUFOSm5JN1lXanNhU3pZZExLanFobStMLzBWL0xwVFVEYWZUUk9qZ3BBUzF0QVNpeXhVMC9iTkNxcUgKYldBOTZhcExabHNVUVFHNHpxbGJHcmpOdy9YY0YzSisxZDVNY21PeVFzaWY1V0lTVW9nOXo5T0NVRWt4NW1McApLN3cvL0pQSGVIVFFNR2hCSS9wbDFZNmQySnpMd3gvSXBja1dTR3RnMWwwNjJHSUMvTGxmWXBZbG4rUzh5NG9CCkh1anNKTlh2KzkvRTkrRzBNTnUxb2xPUjlpR3pXZE0zcTZBR09ETXNDU2JPd1hidm1DdEpJcG1rNTNsSERHZjIKNG9QSERvWk9MaXNuZ1dJdStzTzFxTXJaOE9kZ25ZRXBtMHlPRlVWaW9tYUZPZEV1OUFscGlWUHd2aUN3OXZFNwpHM3FDN2J0QkEvazl4T21USHZKalYvZktMem9vZ1JwVHRlQmcwQnhZTVZObndnNHlqenIycWdnTEJ3YlYyUzg2CmtDUStGbGFVR29EQ3BlOTYwS3BXdlRSK0p3OXY0VXB1ekc2MjJDbzI5cHhXdmhqWU5SdUFjRWhFRm91RXRFQWgKYVUyNGVYMXY4MStzRDdEOGJhR1FmZVJweG5EQ2toWVFFSW52S2JNSGxocDVRY1Z3eW10OVhZU1FDSWJLUTJOcApoVjgxVFhtVkFDem8rYi9vUi9FUnRCbUNyVElGU3cxdkxKWCtOZ3ljL1JoS0t2Smd3NEk1SG9RZDgwOW90NVErClJGR2QrYWRhUTRiU212NU9YdTUwTnFRY2E4YXY3c1RlTjJhNVlPbVFQYm9sSG41NHpaT1cxMGNWd2dpSHJDZ3oKNlpMOEY0M0w5VUdLMEdvVmkvZWF1Znh1eE05YklnYkFuNmd5U1FRY1p6Y0NBd0VBQWFOQ01FQXdEZ1lEVlIwUApBUUgvQkFRREFnS2tNQThHQTFVZEV3RUIvd1FGTUFNQkFmOHdIUVlEVlIwT0JCWUVGTGRSS1JxMzQ0MmU2d1lTCmd2blgwaG1zYnRwME1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQ0FRQUdjNUlySXp4VUI4ZmVtMWNOS0NTUmFzZHkKM1hicnBkWDdqWHBPYXpPdGVTUXN2Rjh2V01zNjhVbXo3SWVieXlZMk1PdWxHTzNUU0JJRzh6a1FYdlhOVFUyaApWbktCd2kvRkNzUHpqMmR6VzhYdWYrcGZYeWVaUGMxT2FuVUw1akdyWW5iOFFJSmF3aXlLM3dhVUNwbmxkZ25rCi8za1F1YS8vWlUySWpULzN5UVI1Q24vZm11TVJZY2FBdm1XM01lN1UwaEcyUUFlOUZRaDV0bitnczVjcGRueEwKcG5BNnFjeFhFZGpYSXNNVDY3SjVYc2ZwbmozSnR3SjMrSVIwdVgwSUJCWU1IOHplSE1JSDNiNGZIS3diRWNuYgpJS3YrQUF1bHcvS25PbDJmcEYva1lhdHhVQzdhRDFZQ2I5cGFvUjJldUpHRlZ6UjlBSk9idTZtbG1TRTZPL3pxCldGU0VoWEZZbmNHWmh4aWRzVmZselpxdXY1bnNmTTUyWmZaWlJPd3pvY3lWWUVoc2lpUTYrcWtDbmdDM1VHd24Ka0U2L01samY2Z1JNZnJMaWRtQW8wOWM0NmVRbXUvbHdla1Brek1IM1J4WDQ0MGh5emxMejQ2dFdXZDNMSEg0YwpoNUhQVExLdVJ0WkJROXZILzdGcWFPcG9wY0IrYnl0dlh1V1laVlpDVmlZNmtwK2RGL3hrT1BMVCsyR2tuNjJFCm8yQnU4WHpQaC85eks4SVMwVUhRUDVBWVFnSnhRRXp3UUdjcW1TVVRNM1kwcEM2TkhWRExMeG5iem9tMllRMEUKME4zL2lOdkhmeVhUVHcrNTVlWCtqVFRpd3lVVk81OW0xNzFnaFlWa21YcUVyemFkYy9Yam5qQWdRb0x6aFE5SQpTNmNPYWl0cUNhc244QXdKc3c9PQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
              - host                   = "https://prefix-924b75a1.332a18d4-a192-4635-be50-8a021733f6ff.privatelink.eastus.azmk8s.io:443"
              - password               = "265dcc4a480d1ebc04b02dcaeaaf455404aa74931efd6b92da01c54f094c81689ad3a1e6b00c57f98ec17c97c561674803a24ff24644b859bb4bc7c0d9844946"
              - username               = "clusterAdmin_aks-resource-group_prefix-aks"
            },
        ] -> (known after apply)
      ~ kube_admin_config_raw           = (sensitive value)
      ~ kube_config                     = [
          - {
              - client_certificate     = ""
              - client_key             = ""
              - cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUU2VENDQXRHZ0F3SUJBZ0lSQUl6UUxOMHMxNm9HYnN3N3Y3amlmMnN3RFFZSktvWklodmNOQVFFTEJRQXcKRFRFTE1Ba0dBMVVFQXhNQ1kyRXdJQmNOTWpFd016TXdNVEV5T0RJeFdoZ1BNakExTVRBek16QXhNVE00TWpGYQpNQTB4Q3pBSkJnTlZCQU1UQW1OaE1JSUNJakFOQmdrcWhraUc5dzBCQVFFRkFBT0NBZzhBTUlJQ0NnS0NBZ0VBCjVJMXo4ZUFOSm5JN1lXanNhU3pZZExLanFobStMLzBWL0xwVFVEYWZUUk9qZ3BBUzF0QVNpeXhVMC9iTkNxcUgKYldBOTZhcExabHNVUVFHNHpxbGJHcmpOdy9YY0YzSisxZDVNY21PeVFzaWY1V0lTVW9nOXo5T0NVRWt4NW1McApLN3cvL0pQSGVIVFFNR2hCSS9wbDFZNmQySnpMd3gvSXBja1dTR3RnMWwwNjJHSUMvTGxmWXBZbG4rUzh5NG9CCkh1anNKTlh2KzkvRTkrRzBNTnUxb2xPUjlpR3pXZE0zcTZBR09ETXNDU2JPd1hidm1DdEpJcG1rNTNsSERHZjIKNG9QSERvWk9MaXNuZ1dJdStzTzFxTXJaOE9kZ25ZRXBtMHlPRlVWaW9tYUZPZEV1OUFscGlWUHd2aUN3OXZFNwpHM3FDN2J0QkEvazl4T21USHZKalYvZktMem9vZ1JwVHRlQmcwQnhZTVZObndnNHlqenIycWdnTEJ3YlYyUzg2CmtDUStGbGFVR29EQ3BlOTYwS3BXdlRSK0p3OXY0VXB1ekc2MjJDbzI5cHhXdmhqWU5SdUFjRWhFRm91RXRFQWgKYVUyNGVYMXY4MStzRDdEOGJhR1FmZVJweG5EQ2toWVFFSW52S2JNSGxocDVRY1Z3eW10OVhZU1FDSWJLUTJOcApoVjgxVFhtVkFDem8rYi9vUi9FUnRCbUNyVElGU3cxdkxKWCtOZ3ljL1JoS0t2Smd3NEk1SG9RZDgwOW90NVErClJGR2QrYWRhUTRiU212NU9YdTUwTnFRY2E4YXY3c1RlTjJhNVlPbVFQYm9sSG41NHpaT1cxMGNWd2dpSHJDZ3oKNlpMOEY0M0w5VUdLMEdvVmkvZWF1Znh1eE05YklnYkFuNmd5U1FRY1p6Y0NBd0VBQWFOQ01FQXdEZ1lEVlIwUApBUUgvQkFRREFnS2tNQThHQTFVZEV3RUIvd1FGTUFNQkFmOHdIUVlEVlIwT0JCWUVGTGRSS1JxMzQ0MmU2d1lTCmd2blgwaG1zYnRwME1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQ0FRQUdjNUlySXp4VUI4ZmVtMWNOS0NTUmFzZHkKM1hicnBkWDdqWHBPYXpPdGVTUXN2Rjh2V01zNjhVbXo3SWVieXlZMk1PdWxHTzNUU0JJRzh6a1FYdlhOVFUyaApWbktCd2kvRkNzUHpqMmR6VzhYdWYrcGZYeWVaUGMxT2FuVUw1akdyWW5iOFFJSmF3aXlLM3dhVUNwbmxkZ25rCi8za1F1YS8vWlUySWpULzN5UVI1Q24vZm11TVJZY2FBdm1XM01lN1UwaEcyUUFlOUZRaDV0bitnczVjcGRueEwKcG5BNnFjeFhFZGpYSXNNVDY3SjVYc2ZwbmozSnR3SjMrSVIwdVgwSUJCWU1IOHplSE1JSDNiNGZIS3diRWNuYgpJS3YrQUF1bHcvS25PbDJmcEYva1lhdHhVQzdhRDFZQ2I5cGFvUjJldUpHRlZ6UjlBSk9idTZtbG1TRTZPL3pxCldGU0VoWEZZbmNHWmh4aWRzVmZselpxdXY1bnNmTTUyWmZaWlJPd3pvY3lWWUVoc2lpUTYrcWtDbmdDM1VHd24Ka0U2L01samY2Z1JNZnJMaWRtQW8wOWM0NmVRbXUvbHdla1Brek1IM1J4WDQ0MGh5emxMejQ2dFdXZDNMSEg0YwpoNUhQVExLdVJ0WkJROXZILzdGcWFPcG9wY0IrYnl0dlh1V1laVlpDVmlZNmtwK2RGL3hrT1BMVCsyR2tuNjJFCm8yQnU4WHpQaC85eks4SVMwVUhRUDVBWVFnSnhRRXp3UUdjcW1TVVRNM1kwcEM2TkhWRExMeG5iem9tMllRMEUKME4zL2lOdkhmeVhUVHcrNTVlWCtqVFRpd3lVVk81OW0xNzFnaFlWa21YcUVyemFkYy9Yam5qQWdRb0x6aFE5SQpTNmNPYWl0cUNhc244QXdKc3c9PQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
              - host                   = "https://prefix-924b75a1.332a18d4-a192-4635-be50-8a021733f6ff.privatelink.eastus.azmk8s.io:443"
              - password               = ""
              - username               = "clusterUser_aks-resource-group_prefix-aks"
            },
        ] -> (known after apply)
      ~ kube_config_raw                 = (sensitive value)
      ~ kubelet_identity                = [
          - {
              - client_id                 = "41d491a8-ffa3-481b-9153-f1c60ed09914"
              - object_id                 = "b7e620a0-7597-4204-976e-df3c39fb51f9"
              - user_assigned_identity_id = "/subscriptions/1336ece0-3256-4a2e-b051-e83ca0c7cd51/resourceGroups/MC_aks-resource-group_prefix-aks_eastus/providers/Microsoft.ManagedIdentity/userAssignedIdentities/prefix-aks-agentpool"
            },
        ] -> (known after apply)
        kubernetes_version              = "1.19.6"
      ~ location                        = "eastus" -> (known after apply) # forces replacement
        name                            = "prefix-aks"
      ~ node_resource_group             = "MC_aks-resource-group_prefix-aks_eastus" -> (known after apply)
        private_cluster_enabled         = true
      ~ private_dns_zone_id             = "system" -> (known after apply)
      ~ private_fqdn                    = "prefix-924b75a1.332a18d4-a192-4635-be50-8a021733f6ff.privatelink.eastus.azmk8s.io" -> (known after apply)
      ~ private_link_enabled            = true -> (known after apply)
        resource_group_name             = "aks-resource-group"
        sku_tier                        = "Free"
      - tags                            = {} -> null

      ~ addon_profile {

            azure_policy {
                enabled = true
            }

          ~ http_application_routing {
                enabled                            = true
              ~ http_application_routing_zone_name = "c561cbb7226b402db0e1.eastus.aksapp.io" -> (known after apply)
            }

            kube_dashboard {
                enabled = false
            }

          ~ oms_agent {
                enabled                    = true
              ~ log_analytics_workspace_id = "/subscriptions/1336ece0-3256-4a2e-b051-e83ca0c7cd51/resourceGroups/aks-resource-group/providers/Microsoft.OperationalInsights/workspaces/prefix-workspace" -> (known after apply)
              ~ oms_agent_identity         = [
                  - {
                      - client_id                 = "4b1ebe76-7a30-4335-bb75-2c6cd42f2a39"
                      - object_id                 = "f7fd27c5-c70e-49e2-bc8f-5994604ae4aa"
                      - user_assigned_identity_id = "/subscriptions/1336ece0-3256-4a2e-b051-e83ca0c7cd51/resourcegroups/MC_aks-resource-group_prefix-aks_eastus/providers/Microsoft.ManagedIdentity/userAssignedIdentities/omsagent-prefix-aks"
                    },
                ] -> (known after apply)
            }
        }

      ~ auto_scaler_profile {
          ~ balance_similar_node_groups      = false -> (known after apply)
          ~ expander                         = "random" -> (known after apply)
          ~ max_graceful_termination_sec     = "600" -> (known after apply)
          ~ new_pod_scale_up_delay           = "0s" -> (known after apply)
          ~ scale_down_delay_after_add       = "10m" -> (known after apply)
          ~ scale_down_delay_after_delete    = "10s" -> (known after apply)
          ~ scale_down_delay_after_failure   = "3m" -> (known after apply)
          ~ scale_down_unneeded              = "10m" -> (known after apply)
          ~ scale_down_unready               = "20m" -> (known after apply)
          ~ scale_down_utilization_threshold = "0.5" -> (known after apply)
          ~ scan_interval                    = "10s" -> (known after apply)
          ~ skip_nodes_with_local_storage    = false -> (known after apply)
          ~ skip_nodes_with_system_pods      = true -> (known after apply)
        }

      ~ default_node_pool {
            availability_zones           = [
                "1",
                "2",
            ]
            enable_auto_scaling          = true
          - enable_host_encryption       = false -> null
            enable_node_public_ip        = false
            max_count                    = 2
          ~ max_pods                     = 100 -> 110 # forces replacement
            min_count                    = 1
            name                         = "exnodepool"
          ~ node_count                   = 1 -> (known after apply)
            node_labels                  = {
                "nodepool" = "defaultnodepool"
            }
          - node_taints                  = [] -> null
          - only_critical_addons_enabled = false -> null
            orchestrator_version         = "1.19.6"
            os_disk_size_gb              = 50
            os_disk_type                 = "Managed"
            tags                         = {
                "Agent" = "defaultnodepoolagent"
            }
            type                         = "VirtualMachineScaleSets"
            vm_size                      = "Standard_D2s_v3"
            vnet_subnet_id               = "/subscriptions/1336ece0-3256-4a2e-b051-e83ca0c7cd51/resourceGroups/aks-resource-group/providers/Microsoft.Network/virtualNetworks/acctvnet/subnets/subnet1"
        }

      ~ identity {
          ~ principal_id = "857fd4a4-d61f-4bc0-a282-9dda7bd0e42a" -> (known after apply)
          ~ tenant_id    = "b48a6a20-a723-4439-9c06-79e3347ff556" -> (known after apply)
            type         = "SystemAssigned"
        }

        linux_profile {
            admin_username = "azureuser"

            ssh_key {
                key_data = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC0m2qzdziXCsWECB7MWI6HzN/rl6TXEqzl6m5gsEFkO0ISFo66A2iIG9T+70WYt2+KeEXazScwsqp03kP5VQvXKgDkxPQ6vzRH1Q3oJqNQWc2SypGiiIlYBJfdwtKQNgdXR0RDZn+C1A4HOYifIsiz6Dq9Mi68uxBpMVzJZIuwNXLIGGehQhsguSny/PybuiAnDpr3SF5IjuprJB3vEw7OSPZoj/539HqJ+iKGbtSMHKZdlLQZWr2jCeM/0FcgOvGyqGoYx0qeM++L/DwSysRU8cfkE1Gu8UFFEGBonXJyVd7rt7w03Oxu1RJZVI8V2hJ3cxRFMp6JPouwYwiAWxkj"
            }
        }

      ~ network_profile {
            dns_service_ip     = "172.21.0.10"
            docker_bridge_cidr = "170.10.0.1/16"
          ~ load_balancer_sku  = "Standard" -> "standard"
          + network_mode       = (known after apply)
            network_plugin     = "azure"
            network_policy     = "azure"
            outbound_type      = "loadBalancer"
          + pod_cidr           = (known after apply)
            service_cidr       = "172.21.0.0/24"

          ~ load_balancer_profile {
              ~ effective_outbound_ips    = [
                  - "/subscriptions/1336ece0-3256-4a2e-b051-e83ca0c7cd51/resourceGroups/MC_aks-resource-group_prefix-aks_eastus/providers/Microsoft.Network/publicIPAddresses/01c9feb9-549a-4bbe-b6ff-a77b99e7e014",
                ] -> (known after apply)
              ~ idle_timeout_in_minutes   = 0 -> (known after apply)
              ~ managed_outbound_ip_count = 1 -> (known after apply)
              ~ outbound_ip_address_ids   = [] -> (known after apply)
              ~ outbound_ip_prefix_ids    = [] -> (known after apply)
              ~ outbound_ports_allocated  = 0 -> (known after apply)
            }
        }

      ~ role_based_access_control {
            enabled = true

          ~ azure_active_directory {
                admin_group_object_ids = [
                    "a4e76421-09aa-482f-866e-0c4ec3461c4a",
                ]
                managed                = true
              ~ tenant_id              = "b48a6a20-a723-4439-9c06-79e3347ff556" -> (known after apply)
            }
        }

      ~ windows_profile {
          + admin_password = (sensitive value)
          ~ admin_username = "azureuser" -> (known after apply)
        }
    }

  # module.aks.azurerm_log_analytics_solution.main[0] must be replaced
-/+ resource "azurerm_log_analytics_solution" "main" {
      ~ id                    = "/subscriptions/1336ece0-3256-4a2e-b051-e83ca0c7cd51/resourcegroups/aks-resource-group/providers/Microsoft.OperationsManagement/solutions/ContainerInsights(prefix-workspace)" -> (known after apply)
      ~ location              = "eastus" -> (known after apply) # forces replacement
        resource_group_name   = "aks-resource-group"
        solution_name         = "ContainerInsights"
      - tags                  = {} -> null
        workspace_name        = "prefix-workspace"
      ~ workspace_resource_id = "/subscriptions/1336ece0-3256-4a2e-b051-e83ca0c7cd51/resourceGroups/aks-resource-group/providers/Microsoft.OperationalInsights/workspaces/prefix-workspace" -> (known after apply) # forces replacement

      ~ plan {
          ~ name      = "ContainerInsights(prefix-workspace)" -> (known after apply)
            product   = "OMSGallery/ContainerInsights"
            publisher = "Microsoft"
        }
    }

  # module.aks.azurerm_log_analytics_workspace.main[0] must be replaced
-/+ resource "azurerm_log_analytics_workspace" "main" {
        daily_quota_gb             = -1
      ~ id                         = "/subscriptions/1336ece0-3256-4a2e-b051-e83ca0c7cd51/resourceGroups/aks-resource-group/providers/Microsoft.OperationalInsights/workspaces/prefix-workspace" -> (known after apply)
        internet_ingestion_enabled = true
        internet_query_enabled     = true
      ~ location                   = "eastus" -> (known after apply) # forces replacement
        name                       = "prefix-workspace"
      + portal_url                 = (known after apply)
      ~ primary_shared_key         = (sensitive value)
        resource_group_name        = "aks-resource-group"
        retention_in_days          = 30
      ~ secondary_shared_key       = (sensitive value)
      ~ sku                        = "pergb2018" -> "PerGB2018"
      - tags                       = {} -> null
      ~ workspace_id               = "93f0bba3-05b0-46c4-9d24-4f1fab59fa50" -> (known after apply)
    }

  # module.network.azurerm_subnet.subnet[0] will be updated in-place
  ~ resource "azurerm_subnet" "subnet" {
        address_prefix                                 = "10.0.1.0/24"
        address_prefixes                               = [
            "10.0.1.0/24",
        ]
      ~ enforce_private_link_endpoint_network_policies = true -> false
        enforce_private_link_service_network_policies  = false
        id                                             = "/subscriptions/1336ece0-3256-4a2e-b051-e83ca0c7cd51/resourceGroups/aks-resource-group/providers/Microsoft.Network/virtualNetworks/acctvnet/subnets/subnet1"
        name                                           = "subnet1"
        resource_group_name                            = "aks-resource-group"
        service_endpoint_policy_ids                    = []
        service_endpoints                              = []
        virtual_network_name                           = "acctvnet"
    }

  # module.aks.module.ssh-key.local_file.private_key[0] will be created
  + resource "local_file" "private_key" {
      + content              = <<~EOT
            -----BEGIN RSA PRIVATE KEY-----
            MIIEowIBAAKCAQEAtJtqs3c4lwrFhAgezFiOh8zf65ek1xKs5epuYLBBZDtCEhaO
            ugNoiBvU/u9FmLdvinhF2s0nMLKqdN5D+VUL1yoA5MT0Or80R9UN6CajUFnNksqR
            ooiJWASX3cLSkDYHV0dEQ2Z/gtQOBzmInyLIs+g6vTIuvLsQaTFcyWSLsDVyyBhn
            oUIbILkp8vz8m7ogJw6a90heSI7qayQd7xMOzkj2aI/+d/R6ifoihm7UjBymXZS0
            GVq9ownjP9BXIDrxsqhqGMdKnjPvi/w8EsrEVPHH5BNRrvFBRRBgaJ1yclXe67e8
            NNzsbtUSWVSPFdoSd3MURTKeiT6LsGMIgFsZIwIDAQABAoIBACDEOZ2Jubideaw0
            lPHZ9zHoF4/0mTFz7+5ek9vy3kpC/f+uHALfb22SLxh5bJUCYrgqjfHeWofZQlel
            o4tuxJEqy7K1kOG/osqNetJtgB+py0QggD+OqexQGQVgvTbwtnA9O8NGq0efFVR2
            ObU1aFhLf6ynmBchkR6kmALpvPYgzgnwG6FfAowIGaKkzzlS3IOEPIk+SaSnJXE+
            Iu/EL3YlTv2spbitPxgXMEuph0ikzj05Xe/oo1DcyiOMQi5bJ2CuT3BAqsCEMT+W
            vBfHcgJwq5KvnCClLqyYTry/Myb66TYCOmm70Yoz35kPIv732HAA3BhWLelTwSRo
            4WAAoEECgYEA6HAP4FgBMiog1/3rZe3IYkJx1IvFaYzrtPb6bI4oUX7cHfoz6mCl
            fEMEiisRKPDKFaqNqlpG4zPg95dIrQdQBPh+QVQxT5I2/+0iCd0wKshWCmYNIenp
            8BQeKtFYv5B4pXIJzVJ888pQx2JMoYNPQW+yNXCEC7DBQKmOIEyh6RECgYEAxupP
            SaIpW3DrImbIxk1xHvH9BCNdsFTKOGqnxdW35o5SQIhKWaZWcqSyq18ouj5v6gIN
            uwu25oCN68e9q1U3y4fKIThVJtCWBjuCkrLsKaKZHPknf6SeQxJk+3p2LbCDsh0R
            AiIv2CF+WsqebSk9MIsxIR6cyK7bMyrJlias/vMCgYB1HGEja7POjqNVsD32cUPR
            HiE0MegZMkNgPkAWidmOlhhZkkKuCFvYq/uRkflnY0qud+xAtJOazfy/Qp3/b/vF
            RV53k+/0Y3sKn3PS/HrUU3PmcVyUhcK0j65TbH8Gpcfjs/10Ueda/ciNbN2nUv2P
            vrNPcY1WRoxYBBXz+ChrwQKBgGcSLKmD/JgkR8LYrbqLkE0vqSKGzNo85Vgcc/kA
            SD2Qi7BirtwLZAodq3M/aNQw3D7Od5zvcgO4o1GEe5SXIMU3BJb4IK9vL/3kwkEP
            s23TkjFALaZnf5ZTpr3kc+4y49rcUt7fJhmBKX8UNMltsAZCad+2hBk8+dpmlnRW
            cBffAoGBAIMM2wjy23QoWcAeeH8gY5BAygVHpHCCNvJsUZlo4PwlrG10xKg0YEec
            Y9NYFWuqakyIluLMm5r4YjQCpxBeJH7415giEOHvbXdpwk5PePWPvm0C7nM4CXau
            3baa+mT707mnq1RHt1hMSaCV5DpKz1XkSNnWDWrvr35B8Lw3hQ3l
            -----END RSA PRIVATE KEY-----
        EOT
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./private_ssh_key"
      + id                   = (known after apply)
    }

Plan: 4 to add, 1 to change, 3 to destroy.
```

</details>

*Pusher: @waxb, Action: `pull_request`*